paulh002/VFO-ESP32-Si5351/vfo_esp32_si5351/gui.cpp
	//Set the theme..
	lv_theme_t* th = lv_theme_material_init(LV_THEME_DEFAULT_COLOR_PRIMARY, LV_THEME_DEFAULT_COLOR_SECONDARY, LV_THEME_MATERIAL_FLAG_DARK, LV_THEME_DEFAULT_FONT_SMALL, LV_THEME_DEFAULT_FONT_NORMAL, LV_THEME_DEFAULT_FONT_SUBTITLE, LV_THEME_DEFAULT_FONT_TITLE);
	lv_theme_set_act(th);

	lv_obj_t* scr = lv_cont_create(NULL, NULL);
	lv_disp_load_scr(scr);

	bg_top = lv_obj_create(scr, NULL);
	lv_obj_clean_style_list(bg_top, LV_OBJ_PART_MAIN);
	lv_obj_set_style_local_bg_opa(bg_top, LV_OBJ_PART_MAIN, LV_STATE_DEFAULT, LV_OPA_COVER);
	lv_obj_set_style_local_bg_color(bg_top, LV_OBJ_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_NAVY);
	lv_obj_set_size(bg_top, LV_HOR_RES, topHeight);

	label_status = lv_label_create(bg_top, NULL);
	lv_label_set_long_mode(label_status, LV_LABEL_LONG_SROLL_CIRC);
	lv_obj_set_width(label_status, LV_HOR_RES - 20);
	lv_label_set_text(label_status, "");
	lv_obj_align(label_status, NULL, LV_ALIGN_CENTER, 20, 0);

	bg_middle = lv_obj_create(scr, NULL);
	lv_obj_clean_style_list(bg_middle, LV_OBJ_PART_MAIN);
	lv_obj_set_style_local_bg_opa(bg_middle, LV_OBJ_PART_MAIN, LV_STATE_DEFAULT, LV_OPA_COVER);
	lv_obj_set_style_local_bg_color(bg_middle, LV_OBJ_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_BLACK);
	lv_obj_set_pos(bg_middle, 0, topHeight);
	lv_obj_set_size(bg_middle, LV_HOR_RES, screenHeight - topHeight);

	smeter = new CSmeter(bg_middle, LV_ALIGN_CENTER, 255, 50, 0, 30);

	// Create groups for encoder support for the different screens
	vfo_group = lv_group_create();
	lv_indev_set_group(encoder_indev_t, vfo_group);
	
	lv_style_init(&style_btn);

	lv_style_set_radius(&style_btn, LV_STATE_DEFAULT, 10);
	lv_style_set_bg_color(&style_btn, LV_STATE_DEFAULT, lv_color_make(0x60, 0x60, 0x60));
	lv_style_set_bg_grad_color(&style_btn, LV_STATE_DEFAULT, lv_color_make(0x00, 0x00, 0x00));
	lv_style_set_bg_grad_dir(&style_btn, LV_STATE_DEFAULT, LV_GRAD_DIR_VER);
	lv_style_set_bg_opa(&style_btn, LV_STATE_DEFAULT, 255);
	lv_style_set_border_color(&style_btn, LV_STATE_DEFAULT, lv_color_make(0x9b, 0x36, 0x36) ); // lv_color_make(0x2e, 0x44, 0xb2)
	lv_style_set_border_width(&style_btn, LV_STATE_DEFAULT, 2);
	lv_style_set_border_opa(&style_btn, LV_STATE_DEFAULT, 255);
	lv_style_set_outline_color(&style_btn, LV_STATE_DEFAULT, LV_COLOR_BLACK);
	lv_style_set_outline_opa(&style_btn, LV_STATE_DEFAULT, 255);
	
	lv_style_set_border_width(&style_btn, LV_STATE_FOCUSED, 2);
	lv_style_set_outline_color(&style_btn, LV_STATE_FOCUSED, LV_COLOR_RED);
	//lv_style_set_border_color(&style_btn, LV_STATE_FOCUSED, LV_COLOR_WHITE);
	//lv_style_set_outline_color(&style_btn, LV_STATE_FOCUSED, LV_COLOR_WHITE);
	//lv_style_set_bg_color(&style_btn, LV_STATE_FOCUSED, LV_COLOR_OLIVE);

	//lv_style_set_border_color(&style_btn, LV_STATE_CHECKED, lv_color_make(0x9b, 0x36, 0x36)); // lv_color_make(0x2e, 0x44, 0xb2)
	//lv_style_set_border_color(&style_btn, LV_STATE_CHECKED, LV_COLOR_BLACK); // lv_color_make(0x2e, 0x44, 0xb2)
	//lv_style_set_border_width(&style_btn, LV_STATE_CHECKED, 2);

	/*Set the text style*/
	lv_style_set_text_color(&style_btn, LV_STATE_DEFAULT, LV_COLOR_WHITE);

	lsb_button = lv_btn_create(bg_middle, NULL);
	lv_obj_add_style(lsb_button, LV_BTN_PART_MAIN, &style_btn);
	lv_obj_set_event_cb(lsb_button, mode_button_eh);
	lv_obj_align(lsb_button, NULL, LV_ALIGN_IN_BOTTOM_LEFT, 0, 0);
	lv_btn_set_checkable(lsb_button, true);
	lv_btn_toggle(lsb_button);
	lv_obj_set_size(lsb_button, bottombutton_width, bottomHeight);
	lv_obj_t* label = lv_label_create(lsb_button, NULL);
	lv_label_set_text(label, "Lsb");
	
	usb_button = lv_btn_create(bg_middle, NULL);
	lv_obj_add_style(usb_button, LV_BTN_PART_MAIN, &style_btn);
	lv_obj_set_event_cb(usb_button, mode_button_eh);
	lv_obj_align(usb_button, NULL, LV_ALIGN_IN_BOTTOM_LEFT, bottombutton_width1, 0);
	lv_btn_set_checkable(usb_button, true);
	lv_obj_set_size(usb_button, bottombutton_width, bottomHeight);
	label = lv_label_create(usb_button, NULL);
	lv_label_set_text(label, "Usb");
	
	vfo1_button = lv_btn_create(bg_middle, NULL);
	lv_obj_add_style(vfo1_button, LV_BTN_PART_MAIN, &style_btn); 
	lv_obj_set_event_cb(vfo1_button, mode_button_vfo);
	lv_obj_align(vfo1_button, NULL, LV_ALIGN_IN_BOTTOM_LEFT, 2 * bottombutton_width1, 0);
	lv_btn_set_checkable(vfo1_button, true);
	lv_btn_toggle(vfo1_button);
	lv_obj_set_size(vfo1_button, bottombutton_width, bottomHeight);
	label = lv_label_create(vfo1_button, NULL);
	lv_label_set_text(label, "Vfo 1");
	
	vfo2_button = lv_btn_create(bg_middle, NULL);
	lv_obj_add_style(vfo2_button, LV_BTN_PART_MAIN, &style_btn); 
	lv_obj_set_event_cb(vfo2_button, mode_button_vfo);
	lv_obj_align(vfo2_button, NULL, LV_ALIGN_IN_BOTTOM_LEFT, 3 * bottombutton_width1, 0);
	lv_btn_set_checkable(vfo2_button, true);
	lv_obj_set_size(vfo2_button, bottombutton_width, bottomHeight);
	label = lv_label_create(vfo2_button, NULL);
	lv_label_set_text(label, "Vfo 2");
	
	band_button = lv_btn_create(bg_middle, NULL);
	lv_obj_add_style(band_button, LV_BTN_PART_MAIN, &style_btn);
	lv_obj_set_event_cb(band_button, event_band_button);
	lv_obj_align(band_button, NULL, LV_ALIGN_IN_BOTTOM_LEFT, 4 * bottombutton_width1, 0);
	lv_obj_set_size(band_button, bottombutton_width, bottomHeight);
	Band_btn_label = lv_label_create(band_button, NULL);
	lv_label_set_text(Band_btn_label, "80m");

	setting_button = lv_btn_create(bg_middle, NULL);
	lv_obj_add_style(setting_button, LV_BTN_PART_MAIN, &style_btn);
	lv_obj_set_event_cb(setting_button, event_button_setting_cb);
	lv_btn_set_checkable(setting_button, true);
	lv_obj_align(setting_button, NULL, LV_ALIGN_IN_BOTTOM_LEFT, 5 * bottombutton_width1, 0);
	lv_obj_set_size(setting_button, bottombutton_width, bottomHeight);
	label = lv_label_create(setting_button, NULL);
	lv_label_set_text(label, LV_SYMBOL_SETTINGS);

	wifi1_button = lv_btn_create(bg_middle, NULL);
	lv_obj_add_style(wifi1_button, LV_BTN_PART_MAIN, &style_btn);
	lv_obj_set_event_cb(wifi1_button, event_button_wifi_cb);
	lv_obj_align(wifi1_button, NULL, LV_ALIGN_IN_BOTTOM_LEFT, 0, -1*(bottomHeight+2));
	lv_obj_set_size(wifi1_button, bottombutton_width, bottomHeight);
	label = lv_label_create(wifi1_button, NULL);
	lv_label_set_text(label, LV_SYMBOL_WIFI);
	lv_obj_set_hidden(wifi1_button, true);
	
	si5351_button = lv_btn_create(bg_middle, NULL);
	lv_obj_add_style(si5351_button, LV_BTN_PART_MAIN, &style_btn);
	lv_obj_set_event_cb(si5351_button, event_button_si5351_cb);
	lv_obj_align(si5351_button, NULL, LV_ALIGN_IN_BOTTOM_LEFT, bottombutton_width1, -1 * (bottomHeight + 2));
	lv_obj_set_size(si5351_button, bottombutton_width, bottomHeight);
	label = lv_label_create(si5351_button, NULL);
	lv_label_set_text(label, "5351");
	lv_obj_set_hidden(si5351_button, true);

	ad8307_button = lv_btn_create(bg_middle, NULL);
	lv_obj_add_style(ad8307_button, LV_BTN_PART_MAIN, &style_btn);
	lv_obj_set_event_cb(ad8307_button, event_button_ad8307_cb);
	lv_obj_align(ad8307_button, NULL, LV_ALIGN_IN_BOTTOM_LEFT, 2 * bottombutton_width1, -1 * (bottomHeight + 2));
	lv_obj_set_size(ad8307_button, bottombutton_width, bottomHeight);
	label = lv_label_create(ad8307_button, NULL);
	lv_label_set_text(label, "8307");
	lv_obj_set_hidden(ad8307_button, true);
	
