paulh002/VFO-ESP32-Si5351/vfo_esp32_si5351/gui.cpp
	reset_button = lv_btn_create(bg_middle, NULL);
	lv_obj_add_style(reset_button, LV_BTN_PART_MAIN, &style_btn);
	lv_obj_set_event_cb(reset_button, event_button_reset_cb);
	lv_obj_align(reset_button, NULL, LV_ALIGN_IN_BOTTOM_LEFT, 3 *  bottombutton_width1, -1 * (bottomHeight + 2));
	lv_obj_set_size(reset_button, bottombutton_width, bottomHeight);
	label = lv_label_create(reset_button, NULL);
	lv_label_set_text(label, "Reset");
	lv_obj_set_hidden(reset_button, true);
	
	bfo_button = lv_btn_create(bg_middle, NULL);
	lv_obj_add_style(bfo_button, LV_BTN_PART_MAIN, &style_btn);
	lv_obj_set_event_cb(bfo_button, event_button_bfo_cb);
	lv_btn_set_checkable(bfo_button, true);
	lv_obj_align(bfo_button, NULL, LV_ALIGN_IN_BOTTOM_LEFT, 4 * bottombutton_width1, -1 * (bottomHeight + 2));
	lv_obj_set_size(bfo_button, bottombutton_width, bottomHeight);
	label = lv_label_create(bfo_button, NULL);
	lv_label_set_text(label, "Bfo");
	lv_obj_set_hidden(bfo_button, true);
	
	save_button = lv_btn_create(bg_middle, NULL);
	lv_obj_add_style(save_button, LV_BTN_PART_MAIN, &style_btn);
	lv_obj_set_event_cb(save_button, event_button_save);
	lv_obj_align(save_button, NULL, LV_ALIGN_IN_BOTTOM_LEFT, 5 * bottombutton_width1, -1 * (bottomHeight + 2));
	lv_obj_set_size(save_button, bottombutton_width, bottomHeight);
	label = lv_label_create(save_button, NULL);
	lv_label_set_text(label, "Save");
	lv_obj_set_hidden(save_button, true);

	static lv_style_t text_style;
	lv_style_init(&text_style);

	/*Set a background color and a radius*/
	lv_style_set_radius(&text_style, LV_STATE_DEFAULT, 5);
	lv_style_set_bg_opa(&text_style, LV_STATE_DEFAULT, LV_OPA_COVER);
	lv_style_set_bg_color(&text_style, LV_STATE_DEFAULT, LV_COLOR_BLACK);
	lv_style_set_value_align(&text_style, LV_STATE_DEFAULT, LV_ALIGN_CENTER);
	lv_style_set_text_font(&text_style, LV_STATE_DEFAULT, &FreeSansOblique42);

	vfo_frequency = lv_label_create(bg_middle, NULL);
	lv_label_set_long_mode(vfo_frequency, LV_LABEL_LONG_CROP);
	lv_obj_add_style(vfo_frequency, LV_OBJ_PART_MAIN, &text_style);
	lv_obj_set_width(vfo_frequency, LV_HOR_RES - 20);
	lv_label_set_text(vfo_frequency, "");
	lv_obj_set_height(vfo_frequency, 40);
	lv_obj_align(vfo_frequency, bg_middle, LV_ALIGN_CENTER, -30, -84);
	lv_label_set_align(vfo_frequency, LV_LABEL_ALIGN_CENTER);

	vfo_unit = lv_label_create(bg_middle, NULL);
	lv_obj_add_style(vfo_unit, LV_OBJ_PART_MAIN, &text_style);
	lv_label_set_text(vfo_unit, "Khz");
	lv_obj_set_height(vfo_unit, 40);
	lv_obj_align(vfo_unit, bg_middle, LV_ALIGN_CENTER, 110, -87);
	lv_label_set_align(vfo_unit, LV_LABEL_ALIGN_CENTER);

	static lv_style_t text_style12;
	lv_style_init(&text_style12);

	/*Set a background color and a radius*/
	lv_style_set_radius(&text_style12, LV_STATE_DEFAULT, 5);
	lv_style_set_bg_opa(&text_style12, LV_STATE_DEFAULT, LV_OPA_COVER);
	lv_style_set_bg_color(&text_style12, LV_STATE_DEFAULT, LV_COLOR_BLACK);
	lv_style_set_value_align(&text_style12, LV_STATE_DEFAULT, LV_ALIGN_CENTER);
	lv_style_set_text_font(&text_style12, LV_STATE_DEFAULT, &FreeSansOblique32);
	lv_style_set_text_color(&text_style12, LV_STATE_DEFAULT, LV_COLOR_OLIVE);

	vfo2_frequency = lv_label_create(bg_middle, NULL);
	lv_label_set_long_mode(vfo2_frequency, LV_LABEL_LONG_CROP);
	lv_obj_add_style(vfo2_frequency, LV_OBJ_PART_MAIN, &text_style12);
	lv_obj_set_width(vfo2_frequency, LV_HOR_RES - 20);
	lv_label_set_text(vfo2_frequency, "28.000.00");
	lv_obj_set_height(vfo2_frequency, 40);
	lv_obj_align(vfo2_frequency, bg_middle, LV_ALIGN_CENTER, -35, -44);
	lv_label_set_align(vfo2_frequency, LV_LABEL_ALIGN_CENTER);
	
	vfo2_unit = lv_label_create(bg_middle, NULL);
	lv_obj_add_style(vfo2_unit, LV_OBJ_PART_MAIN, &text_style12);
	lv_label_set_text(vfo2_unit, "Khz");
	lv_obj_set_height(vfo2_unit, 40);
	lv_obj_align(vfo2_unit, bg_middle, LV_ALIGN_CENTER, 120, -49);
	lv_label_set_align(vfo2_unit, LV_LABEL_ALIGN_CENTER);

	bfo_label = lv_label_create(bg_middle, NULL);
	lv_label_set_long_mode(bfo_label, LV_LABEL_LONG_CROP);
	lv_obj_set_width(bfo_label, 120);
	lv_label_set_text(bfo_label, "8998.0");
	lv_obj_align(bfo_label, NULL, LV_ALIGN_IN_LEFT_MID, 10, -30);

	label_wifi = lv_label_create(bg_top, NULL);
	lv_label_set_long_mode(label_wifi, LV_LABEL_LONG_SROLL_CIRC);
	lv_obj_set_width(label_wifi, LV_HOR_RES - 20);
	lv_label_set_text(label_wifi, LV_SYMBOL_WIFI);
	lv_obj_align(label_wifi, NULL, LV_ALIGN_IN_TOP_LEFT, 0, 5);
	lv_obj_set_hidden(label_wifi, true);

	Tx_led1 = lv_led_create(bg_middle, NULL);
	lv_obj_align(Tx_led1, NULL, LV_ALIGN_CENTER, -125, -70);
	lv_led_off(Tx_led1);
	lv_obj_set_size(Tx_led1, 20, 20);
	
	lv_obj_t* Tx_ledlabel = lv_label_create(bg_middle, NULL);
	lv_obj_align(Tx_ledlabel, Tx_led1, LV_ALIGN_OUT_TOP_MID, 7, 0);
	lv_label_set_text(Tx_ledlabel, "TX");

	// Keep de order of the focus correct
	lv_group_add_obj(vfo_group, lsb_button);
	lv_group_add_obj(vfo_group, usb_button);
	lv_group_add_obj(vfo_group, vfo1_button);
	lv_group_add_obj(vfo_group, vfo2_button);
	lv_group_add_obj(vfo_group, band_button);
	lv_group_add_obj(vfo_group, setting_button);

	lv_group_add_obj(vfo_group, wifi1_button);
	lv_group_add_obj(vfo_group, si5351_button);
	lv_group_add_obj(vfo_group, ad8307_button);
	lv_group_add_obj(vfo_group, reset_button);
	lv_group_add_obj(vfo_group, bfo_button);
	lv_group_add_obj(vfo_group, save_button);

	// TX objects shown when VFO is in TX mode
	static lv_color_t needle_colors[1];
	needle_colors[0] = LV_COLOR_ORANGE;
	
	static lv_style_t gauge_style;
	lv_style_init(&gauge_style);
	lv_style_set_bg_color(&gauge_style, LV_STATE_DEFAULT, LV_COLOR_BLACK);
	lv_style_set_line_color(&gauge_style, LV_STATE_DEFAULT, LV_COLOR_WHITE);
	lv_style_set_scale_end_color(&gauge_style, LV_STATE_DEFAULT, LV_COLOR_RED);
	lv_style_set_text_color(&gauge_style, LV_STATE_DEFAULT, LV_COLOR_WHITE);
	lv_style_set_line_width(&gauge_style, LV_STATE_DEFAULT, 2);
	lv_style_set_line_width(&gauge_style, LV_STATE_DEFAULT, 2);
	lv_style_set_border_side(&gauge_style, LV_STATE_DEFAULT, LV_BORDER_SIDE_NONE);
	lv_style_set_scale_end_line_width(&gauge_style, LV_STATE_DEFAULT, 2);
	lv_style_set_scale_end_border_width(&gauge_style, LV_STATE_DEFAULT, 2);

	Swr_gauge = lv_gauge_create(bg_middle, NULL);
	lv_obj_add_style(Swr_gauge, LV_GAUGE_PART_MAJOR, &gauge_style);
	lv_obj_add_style(Swr_gauge, LV_GAUGE_PART_MAIN, &gauge_style);
	lv_obj_add_style(Swr_gauge, LV_GAUGE_PART_NEEDLE, &gauge_style);
	lv_obj_align(Swr_gauge, NULL, LV_ALIGN_CENTER, 100, 45);
	lv_gauge_set_needle_count(Swr_gauge, 1, needle_colors);
	lv_obj_set_size(Swr_gauge, 160, 160);
	lv_gauge_set_range(Swr_gauge, 0, 100);
	int line_cnt, label_cnt = 5, sub_div = 3;
	line_cnt = (sub_div + 1) * (label_cnt - 1) + 1;
	lv_gauge_set_scale(Swr_gauge, 270, line_cnt, label_cnt);
	lv_gauge_set_critical_value(Swr_gauge, 40);
	lv_gauge_set_angle_offset(Swr_gauge,0);
	/*Allow recoloring of the images according to the needles' color*/
	lv_gauge_set_formatter_cb(Swr_gauge, lv_gauge_format_swr);
	lv_obj_set_style_local_image_recolor_opa(Swr_gauge, LV_GAUGE_PART_NEEDLE, LV_STATE_DEFAULT, LV_OPA_COVER);
	
	lv_obj_t* swr_label = lv_label_create(Swr_gauge, NULL);
	lv_obj_align(swr_label, Swr_gauge, LV_ALIGN_IN_BOTTOM_MID, 0, -15);
	lv_label_set_text(swr_label, "Swr");
	lv_obj_set_hidden(Swr_gauge, true);
	swr_vlabel = lv_label_create(Swr_gauge, NULL);
	lv_obj_align(swr_vlabel, Swr_gauge, LV_ALIGN_IN_BOTTOM_MID, 0, -30);
	lv_label_set_text(swr_vlabel, "0.0");
	lv_obj_set_hidden(Swr_gauge, true);

	pwr_gauge = lv_gauge_create(bg_middle, NULL);
	lv_obj_add_style(pwr_gauge, LV_GAUGE_PART_MAJOR, &gauge_style);
	lv_obj_add_style(pwr_gauge, LV_GAUGE_PART_MAIN, &gauge_style);
	lv_obj_add_style(pwr_gauge, LV_GAUGE_PART_NEEDLE, &gauge_style);
	lv_obj_align(pwr_gauge, NULL, LV_ALIGN_CENTER, -65, 45);
	lv_gauge_set_needle_count(pwr_gauge, 1, needle_colors);
	lv_obj_set_size(pwr_gauge, 160, 160);
	lv_gauge_set_range(pwr_gauge, 0, R.scale_watt *10);
	label_cnt = 5; sub_div = 3;
	line_cnt = (sub_div + 1) * (label_cnt - 1) + 1;
	lv_gauge_set_scale(pwr_gauge, 270, line_cnt, label_cnt);
	lv_gauge_set_critical_value(pwr_gauge, (R.scale_watt * 10));
	lv_gauge_set_angle_offset(pwr_gauge, 0);
	lv_gauge_set_formatter_cb(pwr_gauge, lv_gauge_format_pwr);
	/*Allow recoloring of the images according to the needles' color*/
	lv_obj_set_style_local_image_recolor_opa(pwr_gauge, LV_GAUGE_PART_NEEDLE, LV_STATE_DEFAULT, LV_OPA_COVER);
	lv_obj_t* pwr_label = lv_label_create(pwr_gauge, NULL);
	lv_obj_align(pwr_label, pwr_gauge, LV_ALIGN_IN_BOTTOM_MID, 0, -15);
	lv_label_set_text(pwr_label, "Watt");
	pwr_vlabel = lv_label_create(pwr_gauge, NULL);
	lv_obj_align(pwr_vlabel, pwr_gauge, LV_ALIGN_IN_BOTTOM_MID, 0, -30);
	lv_label_set_text(pwr_vlabel, "0.0");
	lv_obj_set_hidden(pwr_gauge, true);

	gui_setup(scr);
	gui_si5351(scr);
	init_wifi_gui(scr);
	init_cal_ad8307_gui(scr);

	BfoLabel(get_bfo(active_vfo) / 100, 0);
	setfrequencylabel(get_vfo_frequency(active_vfo), get_vfo_frequency(1 - active_vfo));
	ToggleVfo(active_vfo, 0);

