paulh002/VFO-ESP32-Si5351/vfo_esp32_si5351/gui.cpp
	// Set default focus to band selector
	lv_indev_set_group(encoder_indev_t, vfo_group); 
	lv_group_focus_obj(usb_button);

	xSemaphoreGive(GuiBinarySemaphore);
	int tt = 0;
	while (1) {
/*
* Call the lv_task_handler to process GUI changes
* Semaphores are there for thread save GUI changes from other threads
* lv_task_handler should not be executed if other tasks change the GUI
*/
		xSemaphoreTake(GuiBinarySemaphore, portMAX_DELAY);
		lv_task_handler();
		xSemaphoreGive(GuiBinarySemaphore);
		
		if ((f_cal_si5351 == false) && (f_bfo_adjust == false))  // Both si5351 and bfo adjust use optical encoder, so don't change vfo freq at the same time
		{
			int count = Enc_vfo.getCount();
			if (count != 0)
			{
				/*
				* Translate the encoder movement to a new frequency
				* If the band is changed also update the band roller
				*/
				char str[32];
				long frq = set_encoder_count_to_vfo_frequency(count, active_vfo);
				Enc_vfo.clearCount();
				setfrequencylabel(frq, get_vfo_frequency(1 - active_vfo));
				uint16_t i = get_band(str);
				lv_label_set_text(Band_btn_label, str);
			}
		}

/*		
* Process rotary press button messages
*/
		smeter->Draw(get_smeter());
		rotary_button.check();

		static volatile int lastPowerEncoding;
		static	bool	hide_rx = true;
		if ((f_rxtx) && (f_cal_ad8307 == false) && (f_cal_si5351 == false) && (f_bfo_adjust == false))
		{
			if (hide_rx == false)
			{
				hide_rx = true;		
				smeter->hide(true);
				lv_obj_set_hidden(Swr_gauge, false);
				lv_obj_set_hidden(pwr_gauge, false);
				hide_buttons(true);
			}
			pswr_sync_from_interrupt();
			calc_SWR_and_power();
			int currMillis = millis();
			if (currMillis - lastPowerEncoding > POLL_TIMER)
			{
				uint16_t swr, pep;


				swr = print_swr();
				pep = (uint16_t) (power_mw_pep / 100.0);
				lv_gauge_set_value(Swr_gauge, 0, swr/10);
				lv_gauge_set_value(pwr_gauge, 0, pep);
				char buf[32];
				sprintf(buf,"1:%d.%d", swr / 100, (swr / 10) % 10);
				lv_label_set_text(swr_vlabel, buf);
				print_p_mw(power_mw_pep);
				lv_label_set_text(pwr_vlabel, lcd_buf);
				//lv_label_set_text(pwr_vlabel, String((double)power_mw_pep / 1000.0).c_str());
				//Serial.println("SWR: " + String(swr) + " Power: " + String(power_mw_pep));
				lastPowerEncoding = currMillis;
			}

		}
		else
		{
			if (hide_rx == true)
			{
				hide_rx = false;
				smeter->hide(false);
				lv_obj_set_hidden(Swr_gauge, true);
				lv_obj_set_hidden(pwr_gauge, true);
				hide_buttons(false);	
				hide_setting(true);
				lv_obj_clear_state(setting_button, LV_STATE_CHECKED);
			}
		}
		// Capture optical encoder to update BFO frequency
		if (f_bfo_adjust)
		{
			int count = Enc_vfo.getCount();
			if (count != 0)
			{
				/*
				* Translate the encoder movement to a new bfo frequency
				* If the band is changed also update the band roller
				*/
				char str[32];
				long freq = 0L;
				Enc_vfo.clearCount();
				freq = set_encoder_count_to_bfo_frequency(count);
				setbfolabel(freq);
			}
		}
		
		
		if (f_cal_ad8307)
		{
			uint8_t inputq = check_input_cal();
			lv_color_t color_t = LV_COLOR_RED;
			String	sStr;

			switch (inputq)
			{
			case CAL_FWD:
				color_t = LV_COLOR_GREEN;
				sStr = String("Power Ok:");
				break;
			case CAL_REV:
				color_t = LV_COLOR_ORANGE;
				sStr = String("Power rev:");
				break;
			case CAL_BAD:
				color_t = LV_COLOR_RED;
				sStr = String("Power Low:");
				break;
			}
			uint16_t fwd, rev;

			fwd = analogRead(FWD_METER);
			rev = analogRead(REV_METER);
			updateBottomStatus(color_t, String(sStr + " Fwd: " + String(adc_ref * ((double)fwd / 4096.0)) + "V Rev: " + String(adc_ref * ((double)rev / 4096.0))).c_str(),0);
		}

		
		// Calibrate si5351
		
		if (f_cal_si5351 == true)
		{
			int count = Enc_vfo.getCount();
			if (count != 0)
			{
				/*
				* Translate the encoder movement to a new frequency
				* If the band is changed also update the band roller
				*/
				char str[32];
				long freq = 0L;
				Enc_vfo.clearCount();
				if (f_cal_si5351_vfo)
				{
					R.correction_si5351_no1 += count;
					if (R.correction_si5351_no1 < -100000L) R.correction_si5351_no1 = -100000L;
					if (R.correction_si5351_no1 > 100000L) R.correction_si5351_no1 = 0;
					freq = R.correction_si5351_no1;
					cal_vfo();
				}
				else
				{
					R.correction_si5351_no2 += count; 
					if (R.correction_si5351_no2 < -100000L) R.correction_si5351_no2 = -100000L;
					if (R.correction_si5351_no2 > 100000L) R.correction_si5351_no2 = 0;
					freq = R.correction_si5351_no2;
					cal_bfo();
				}
				si_setcalfrequency(freq);
			}
		}		
		vTaskDelay(1);
	}
}

void si_setcalfrequency(long freq)
{
	char	str[80];

	if (freq < 0)
		sprintf(str, "-%ld,%03ld", abs(freq) / 1000L, (abs(freq)) % 1000L);
	else
		sprintf(str, "%ld,%03ld", abs(freq) / 1000L, (abs(freq)) % 1000L);
	lv_label_set_text(si_frequency, str);
}

// Callbacks

/* Display flushing */
void my_disp_flush(lv_disp_drv_t* disp, const lv_area_t* area, lv_color_t* color_p)
{
	uint16_t c;

	tft.startWrite(); /* Start new TFT transaction */
	tft.setAddrWindow(area->x1, area->y1, (area->x2 - area->x1 + 1), (area->y2 - area->y1 + 1)); /* set the working window */
	for (int y = area->y1; y <= area->y2; y++) {
		for (int x = area->x1; x <= area->x2; x++) {
			c = color_p->full;
			tft.writeColor(c, 1);
			color_p++;
		}
	}
	tft.endWrite(); /* terminate TFT transaction */
	lv_disp_flush_ready(disp); /* tell lvgl that flushing is done */
}

bool my_touchpad_read(lv_indev_drv_t* indev_driver, lv_indev_data_t* data)
{
	uint16_t touchX, touchY;

	bool touched = tft.getTouch(&touchX, &touchY, 600);

	if (tft.getRotation() == 1)
	{
		touchX = screenWidth - touchX;
	}

	if (!touched)
	{
		return false;
	}

	if (touchX > screenWidth || touchY > screenHeight)
	{
		Serial.println("Y or y outside of expected parameters..");
		Serial.print("y:");
		Serial.print(touchX);
		Serial.print(" x:");
		Serial.print(touchY);
	}
	else
	{

		data->state = touched ? LV_INDEV_STATE_PR : LV_INDEV_STATE_REL;

		/*Save the state and save the pressed coordinate*/
		//if(data->state == LV_INDEV_STATE_PR) touchpad_get_xy(&last_x, &last_y);

		/*Set the coordinates (if released use the last pressed coordinates)*/
		data->point.x = touchX;
		data->point.y = touchY;

