paulh002/VFO-ESP32-Si5351/vfo_esp32_si5351/gui.cpp
	/*	Serial.print("Data x");
		Serial.println(touchX);

		Serial.print("Data y");
		Serial.println(touchY);
	*/
	}

	return false; /*Return `false` because we are not buffering and no more data to read*/
}

static void mode_button_eh(lv_obj_t* obj, lv_event_t event)
{
	if (event == LV_EVENT_PRESSED)
	{	
		bool bchecked = lv_btn_get_state(obj) & LV_STATE_CHECKED;
		//Serial.println(String("state checked:") + String(bchecked));

		if (obj == usb_button)
		{
			if (bchecked)
			{
				lv_obj_clear_state(lsb_button, LV_STATE_CHECKED);
				switch_mode(MODE_USB, active_vfo);
			}
			else
			{
				lv_obj_add_state(lsb_button, LV_STATE_CHECKED);
				switch_mode(MODE_LSB, active_vfo);
			}
		}
		if (obj == lsb_button)
		{
			if (bchecked)
			{
				lv_obj_clear_state(usb_button, LV_STATE_CHECKED);
				switch_mode(MODE_LSB, active_vfo);
			}
			else
			{
				lv_obj_add_state(usb_button, LV_STATE_CHECKED);
				switch_mode(MODE_USB, active_vfo);
			}
		}
	}
}

static void hide_buttons(bool hide)
{
	lv_obj_set_hidden(usb_button, hide);
	lv_obj_set_hidden(lsb_button, hide);
	lv_obj_set_hidden(vfo1_button, hide);
	lv_obj_set_hidden(vfo2_button, hide);
	lv_obj_set_hidden(band_button, hide);
	lv_obj_set_hidden(setting_button, hide);
	lv_obj_set_hidden(bfo_label, hide);
	lv_obj_set_hidden(vfo2_frequency, hide);
	lv_obj_set_hidden(vfo2_unit, hide);
}

static void hide_setting(bool hide)
{
	smeter->hide(!hide);
	lv_obj_set_hidden(save_button, hide);
	lv_obj_set_hidden(wifi1_button, hide);
	lv_obj_set_hidden(si5351_button, hide);
	lv_obj_set_hidden(ad8307_button, hide);
	lv_obj_set_hidden(reset_button, hide);
	lv_obj_set_hidden(bfo_button, hide);
	lv_obj_clear_state(bfo_button, LV_STATE_CHECKED);
	//show_setting = !hide;
	//f_bfo_adjust = !f_bfo_adjust;
}



static void event_button_setting_cb(lv_obj_t* obj, lv_event_t event)
{
	if (event == LV_EVENT_PRESSED)
	{
		bool bchecked = lv_btn_get_state(obj) & LV_STATE_CHECKED;
		f_bfo_adjust = false;
		hide_setting(!bchecked);
	}
}

static void event_button_bfo_cb(lv_obj_t* obj, lv_event_t event)
{
	if (event == LV_EVENT_PRESSED)
	{
		bool bchecked = lv_btn_get_state(obj) & LV_STATE_CHECKED;
		f_bfo_adjust = bchecked;
	}
}

static void event_button_wifi_cb(lv_obj_t* obj, lv_event_t event)
{
	if (event == LV_EVENT_PRESSED) {
		show_wifi_gui(true);
	}
}

static void event_button_si5351_cb(lv_obj_t* obj, lv_event_t event)
{
	if (event == LV_EVENT_PRESSED) {
		vTaskDelay(100);
		f_cal_si5351 = true;
		lv_obj_move_foreground(bg_middle3);
		lv_indev_set_group(encoder_indev_t, si_5351_group);
		si_setcalfrequency(R.correction_si5351_no1);
		lv_obj_add_state(si_vfo_button, LV_STATE_CHECKED);
		start_cal();
	}
}

static void event_button_reset_cb(lv_obj_t* obj, lv_event_t event)
{
	if (event == LV_EVENT_PRESSED) {
		memset(&R, 0, sizeof(R));
		init_vfo();
		SaveEEPROM();
		ESP.restart();
	}
}

static void event_button_ad8307_cb(lv_obj_t* obj, lv_event_t event)
{
	if (event == LV_EVENT_PRESSED) {
		lv_obj_move_foreground(bg_calgui);
		lv_obj_move_foreground(bg_top_cal);
		lv_indev_set_group(encoder_indev_t, cal_group);
		start_ad8307_cal();
	}
}

static void mode_button_vfo(lv_obj_t* obj, lv_event_t event)
{
	/*if (event == LV_EVENT_CLICKED) {
		//printf("Clicked\n");
	}
	else */  
	if (event == LV_EVENT_PRESSED /*LV_EVENT_VALUE_CHANGED*/) {

		bool bchecked = lv_btn_get_state(obj) & LV_STATE_CHECKED;
		//Serial.println(String("state vfo checked:") + String(bchecked));

		if (obj == vfo1_button)
		{
			if (bchecked)
			{
				lv_obj_clear_state(vfo2_button, LV_STATE_CHECKED);
				active_vfo = 0;
			}
			else
			{
				lv_obj_add_state(vfo2_button, LV_STATE_CHECKED);
				active_vfo = 1;
			}
		}
		if (obj == vfo2_button)
		{
			if (bchecked)
			{
				lv_obj_clear_state(vfo1_button, LV_STATE_CHECKED);
				active_vfo = 1;
			}
			else
			{
				lv_obj_add_state(vfo1_button, LV_STATE_CHECKED);
				active_vfo = 0;
			}
		}
		long frq = switch_vfo(active_vfo);
		setfrequencylabel(frq, get_vfo_frequency(1 - active_vfo));
	}
}

void updateBottomStatus(lv_color_t color, String text, uint8_t sem) {
	if (sem) xSemaphoreTake(GuiBinarySemaphore, portMAX_DELAY);
	lv_obj_set_style_local_bg_color(bg_top, LV_OBJ_PART_MAIN, LV_STATE_DEFAULT, color);
	lv_label_set_text(label_status, text.c_str());
	if (sem) xSemaphoreGive(GuiBinarySemaphore);
}

void showWifilabel(bool show) {
	xSemaphoreTake(GuiBinarySemaphore, portMAX_DELAY);
	lv_obj_set_hidden(label_wifi, show);
	xSemaphoreGive(GuiBinarySemaphore);
}


// this function is used to set the display frequency, it is not using semaphore because this is done from main loop
void setfrequencylabel(long freq, long freq2, uint8_t sem) {
	if (sem) xSemaphoreTake(GuiBinarySemaphore, portMAX_DELAY);
	char str[80];

	sprintf(str, "%3d.%03d,%02d", freq / 1000000, (freq / 1000) % 1000, (freq / 10) % 100);
	lv_label_set_text(vfo_frequency, str);
	
	sprintf(str, "%3d.%03d,%02d", freq2 / 1000000, (freq2 / 1000) % 1000, (freq2 / 10) % 100);
	lv_label_set_text(vfo2_frequency, str);
	if (sem) xSemaphoreGive(GuiBinarySemaphore);
}

void setbfolabel(long freq, uint8_t sem) {
	if (sem) xSemaphoreTake(GuiBinarySemaphore, portMAX_DELAY);
	char str[80];

	sprintf(str, "Bfo:%2d.%03d,%02d Khz", freq / 1000000, (freq / 1000) % 1000, (freq / 10) % 100);
	lv_label_set_text(bfo_label, str);
	if (sem) xSemaphoreGive(GuiBinarySemaphore);
}

static void event_band_button(lv_obj_t* obj, lv_event_t event)
{
	if (event == LV_EVENT_PRESSED) {
		char	buf[80];
		long	frq;

		strcpy(buf, lv_label_get_text(Band_btn_label));
		buf[2] = '\0';
		frq = band_select_next(buf, active_vfo);
		setfrequencylabel(frq, get_vfo_frequency(1 - active_vfo));
		set_vfo_frequency(frq, active_vfo);
		lv_label_set_text(Band_btn_label, buf);
	}
}

void ToggleTX(uint8_t show) {
	xSemaphoreTake(GuiBinarySemaphore, portMAX_DELAY);
	if (show)
		lv_led_on(Tx_led1);
	else
		lv_led_off(Tx_led1);
	xSemaphoreGive(GuiBinarySemaphore);
}


static void event_button_save(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		save_vfo();
		SaveEEPROM();
	}
}

void ToggleSetup(bool show, uint8_t sem) 
{
	if (sem) xSemaphoreTake(GuiBinarySemaphore, portMAX_DELAY);
	if (show)
	{
		lv_obj_move_foreground(bg_middle2);
		lv_indev_set_group(encoder_indev_t, setup_group);
		lv_group_focus_obj(btn_matrix);
	}
	else
	{
		lv_obj_move_background(bg_middle2);
		lv_indev_set_group(encoder_indev_t, vfo_group);
		lv_group_focus_obj(lsb_button);
	}
	if (sem) xSemaphoreGive(GuiBinarySemaphore);
}

void BfoLabel(uint32_t num, uint8_t sem) {
	if (sem)
		xSemaphoreTake(GuiBinarySemaphore, portMAX_DELAY);
	char str[32];
	sprintf(str, "Bfo: %ld.%ld Khz", num / 10, num % 10);
	lv_label_set_text(bfo_label, str);
	//lv_spinbox_set_value(bfo_spinbox, num);
	if (sem)
		xSemaphoreGive(GuiBinarySemaphore);
}

void Togglemode(int mode, uint8_t sem)
{
	if (sem)
		xSemaphoreTake(GuiBinarySemaphore, portMAX_DELAY); 
	if (mode == MODE_LSB)
	{
		lv_btn_set_state(lsb_button, LV_BTN_STATE_CHECKED_RELEASED);
		lv_btn_set_state(usb_button, LV_BTN_STATE_RELEASED);
	}
	if (mode == MODE_USB)
	{
		lv_btn_set_state(usb_button, LV_BTN_STATE_CHECKED_RELEASED);
		lv_btn_set_state(lsb_button, LV_BTN_STATE_RELEASED);
	}
	if (sem)
		xSemaphoreGive(GuiBinarySemaphore);
}

void ToggleVfo(int active_vfo, uint8_t sem)
{
	if (sem) xSemaphoreTake(GuiBinarySemaphore, portMAX_DELAY);
	if (active_vfo)
	{
		lv_obj_add_state(vfo2_button, LV_STATE_CHECKED);
		lv_obj_clear_state(vfo1_button, LV_STATE_CHECKED);
	}
	else
	{
		lv_obj_add_state(vfo1_button, LV_STATE_CHECKED);
		lv_obj_clear_state(vfo2_button, LV_STATE_CHECKED);
	}
	if (sem) xSemaphoreGive(GuiBinarySemaphore);
}

static void gui_setup_event_handler(lv_obj_t* obj, lv_event_t event)
{
	if (event == LV_EVENT_VALUE_CHANGED) {
		uint16_t abutton = lv_btnmatrix_get_active_btn(obj);
		switch (abutton)
		{
		case 0:
			show_wifi_gui(true);
			break;
		case 1:
			//Si5351 calibration
			vTaskDelay(100);
			f_cal_si5351 = true;
			lv_obj_move_foreground(bg_middle3);
			lv_indev_set_group(encoder_indev_t, si_5351_group);
			si_setcalfrequency(R.correction_si5351_no1);
			lv_obj_add_state(si_vfo_button, LV_STATE_CHECKED); 
			start_cal();
			break;
		case 2:
			lv_obj_move_foreground(bg_calgui);
			lv_obj_move_foreground(bg_top_cal);
			lv_indev_set_group(encoder_indev_t, cal_group);
			start_ad8307_cal();
			break;
		case 3:
			memset(&R, 0, sizeof(R));
			init_vfo();
			SaveEEPROM();
			ESP.restart();
			break;
		}
		
