paulh002/VFO-ESP32-Si5351/vfo_esp32_si5351/gui.cpp
	}
}

static void gui_setup(lv_obj_t* scr)
{
	static const char* setup_btnm_map[] = { LV_SYMBOL_WIFI, "Si5351", "Calibrate\n AD8307", "Reset", "" };

	bg_middle2 = lv_obj_create(scr, NULL);
	lv_obj_clean_style_list(bg_middle2, LV_OBJ_PART_MAIN);
	lv_obj_set_style_local_bg_opa(bg_middle2, LV_OBJ_PART_MAIN, LV_STATE_DEFAULT, LV_OPA_COVER);
	lv_obj_set_style_local_bg_color(bg_middle2, LV_OBJ_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_BLACK);
	lv_obj_set_pos(bg_middle2, 0, topHeight);
	lv_obj_set_size(bg_middle2, LV_HOR_RES, screenHeight - topHeight);
	lv_obj_move_background(bg_middle2);

	btn_matrix = lv_btnmatrix_create(bg_middle2, NULL);
	lv_btnmatrix_set_map(btn_matrix, setup_btnm_map);
	lv_obj_align(btn_matrix, NULL, LV_ALIGN_CENTER, 0, 0);
	lv_btnmatrix_set_btn_ctrl(btn_matrix, 6, LV_BTNMATRIX_CTRL_CHECKABLE);
	lv_obj_set_event_cb(btn_matrix, gui_setup_event_handler);
	setup_group = lv_group_create();
	lv_group_add_obj(setup_group, btn_matrix);

	lv_obj_t* pwd_label1 = lv_label_create(bg_middle2, NULL);
	lv_label_set_text(pwd_label1, "Setup");
	lv_obj_align(pwd_label1, btn_matrix, LV_ALIGN_OUT_TOP_LEFT, 0, 0);
}


static void si_vfo_button_cb(lv_obj_t* obj, lv_event_t e)
{
	if (e == LV_EVENT_PRESSED )
	{
		bool bchecked = lv_btn_get_state(obj) & LV_STATE_CHECKED;
		if (obj == si_vfo_button)
		{
			if (bchecked)
			{
				lv_obj_clear_state(si_bfo_button, LV_STATE_CHECKED);
				f_cal_si5351_vfo = true;
				lv_label_set_text(si_label1, "Calibrating si5351 VFO");
				si_setcalfrequency(R.correction_si5351_no1);
			}
			else
			{
				lv_obj_add_state(si_bfo_button, LV_STATE_CHECKED);
				f_cal_si5351_vfo = false;
				lv_label_set_text(si_label1, "Calibrating si5351 BFO");
				si_setcalfrequency(R.correction_si5351_no2);
			}
		}
	}
}

static void si_bfo_button_cb(lv_obj_t* obj, lv_event_t e)
{
	if (e == LV_EVENT_PRESSED) 
	{
		bool bchecked = lv_btn_get_state(obj) & LV_STATE_CHECKED;
		if (obj == si_bfo_button)
		{
			if (bchecked)
			{
				lv_obj_clear_state(si_vfo_button, LV_STATE_CHECKED);
				f_cal_si5351_vfo = false;
				lv_label_set_text(si_label1, "Calibrating si5351 BFO");
				si_setcalfrequency(R.correction_si5351_no2);
			}
			else
			{
				lv_obj_add_state(si_vfo_button, LV_STATE_CHECKED);
				f_cal_si5351_vfo = true;
				lv_label_set_text(si_label1, "Calibrating si5351 VFO");
				si_setcalfrequency(R.correction_si5351_no1);
			}
		}
	}
}

static void si_save_button_cb(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_PRESSED) {
		SaveEEPROM();
		updateBottomStatus(LV_COLOR_GREEN, "Si5351 calibration saved", 0);
		lv_obj_move_foreground(bg_middle);
		lv_obj_move_background(bg_middle3);
		lv_indev_set_group(encoder_indev_t, vfo_group);
		f_cal_si5351 = false;
	}
}

static void si_cancel_button_cb(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_PRESSED) {
		lv_obj_move_foreground(bg_middle);
		lv_obj_move_background(bg_middle3);
		lv_indev_set_group(encoder_indev_t, vfo_group);
		f_cal_si5351 = false;
	}
}

static void gui_si5351(lv_obj_t* scr)
{
	bg_middle3 = lv_obj_create(scr, NULL);
	lv_obj_clean_style_list(bg_middle3, LV_OBJ_PART_MAIN);
	lv_obj_set_style_local_bg_opa(bg_middle3, LV_OBJ_PART_MAIN, LV_STATE_DEFAULT, LV_OPA_COVER);
	lv_obj_set_style_local_bg_color(bg_middle3, LV_OBJ_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_BLACK);
	lv_obj_set_pos(bg_middle3, 0, topHeight);
	lv_obj_set_size(bg_middle3, LV_HOR_RES, screenHeight - topHeight);
	lv_obj_move_background(bg_middle3);

	si_vfo_button = lv_btn_create(bg_middle3, NULL);
	lv_obj_add_style(si_vfo_button, LV_BTN_PART_MAIN, &style_btn);
	lv_obj_set_event_cb(si_vfo_button, si_vfo_button_cb);
	lv_obj_align(si_vfo_button, NULL, LV_ALIGN_IN_BOTTOM_LEFT, 0, 0);
	lv_btn_set_checkable(si_vfo_button, true);
	lv_obj_set_size(si_vfo_button, bottombutton_width, bottomHeight);
	lv_obj_t* label = lv_label_create(si_vfo_button, NULL);
	lv_label_set_text(label, "VFO");
	lv_obj_add_state(si_vfo_button, LV_STATE_CHECKED);

	si_bfo_button = lv_btn_create(bg_middle3, NULL);
	lv_obj_add_style(si_bfo_button, LV_BTN_PART_MAIN, &style_btn);
	lv_obj_set_event_cb(si_bfo_button, si_bfo_button_cb);
	lv_obj_align(si_bfo_button, NULL, LV_ALIGN_IN_BOTTOM_LEFT, bottombutton_width1, 0);
	lv_btn_set_checkable(si_bfo_button, true);
	lv_btn_toggle(vfo1_button); 
	lv_obj_set_size(si_bfo_button, bottombutton_width, bottomHeight);
	label = lv_label_create(si_bfo_button, NULL);
	lv_label_set_text(label, "BFO");

	si_save_button = lv_btn_create(bg_middle3, NULL);
	lv_obj_add_style(si_save_button, LV_BTN_PART_MAIN, &style_btn);
	lv_obj_set_event_cb(si_save_button, si_save_button_cb);
	lv_obj_align(si_save_button, NULL, LV_ALIGN_IN_BOTTOM_LEFT, 2 * bottombutton_width1, 0);
	lv_obj_set_size(si_save_button, bottombutton_width, bottomHeight);
	label = lv_label_create(si_save_button, NULL);
	lv_label_set_text(label, "Save");

	si_cancel_button = lv_btn_create(bg_middle3, NULL);
	lv_obj_add_style(si_cancel_button, LV_BTN_PART_MAIN, &style_btn);
	lv_obj_set_event_cb(si_cancel_button, si_cancel_button_cb);
	lv_obj_align(si_cancel_button, NULL, LV_ALIGN_IN_BOTTOM_LEFT, 3 * bottombutton_width1, 0);
	lv_obj_set_size(si_cancel_button, bottombutton_width, bottomHeight);
	label = lv_label_create(si_cancel_button, NULL);
	lv_label_set_text(label, "Cancel");

	static lv_style_t text_style;
	lv_style_init(&text_style);

	/*Set a background color and a radius*/
	lv_style_set_radius(&text_style, LV_STATE_DEFAULT, 5);
	lv_style_set_bg_opa(&text_style, LV_STATE_DEFAULT, LV_OPA_COVER);
	lv_style_set_bg_color(&text_style, LV_STATE_DEFAULT, LV_COLOR_BLACK);
	lv_style_set_value_align(&text_style, LV_STATE_DEFAULT, LV_ALIGN_CENTER);
	lv_style_set_text_font(&text_style, LV_STATE_DEFAULT, &FreeSansOblique42);

	si_frequency = lv_label_create(bg_middle3, NULL);
	lv_label_set_long_mode(si_frequency, LV_LABEL_LONG_CROP);
	lv_obj_add_style(si_frequency, LV_OBJ_PART_MAIN, &text_style);
	lv_obj_set_width(si_frequency, LV_HOR_RES - 20);
	lv_label_set_text(si_frequency, "");
	lv_obj_set_height(si_frequency, 40);
	lv_obj_align(si_frequency, bg_middle, LV_ALIGN_CENTER, -30, -84);
	lv_label_set_align(si_frequency, LV_LABEL_ALIGN_CENTER);

	si_unit = lv_label_create(bg_middle3, NULL);
	lv_obj_add_style(si_unit, LV_OBJ_PART_MAIN, &text_style);
	lv_label_set_text(si_unit, "Khz");
	lv_obj_set_height(si_unit, 40);
	lv_obj_align(si_unit, bg_middle, LV_ALIGN_CENTER, 110, -87);
	lv_label_set_align(si_unit, LV_LABEL_ALIGN_CENTER);


	si_label1 = lv_label_create(bg_middle3, NULL);
	lv_label_set_text(si_label1, "Calibrating si5351 VFO");
	lv_obj_align(si_label1, NULL, LV_ALIGN_CENTER, 0, 0);

	si_5351_group = lv_group_create(); 
	lv_group_add_obj(si_5351_group, si_vfo_button);
	lv_group_add_obj(si_5351_group, si_bfo_button);
	lv_group_add_obj(si_5351_group, si_save_button);
	
