paulh002/VFO-ESP32-Si5351/vfo_esp32_si5351/gui.cpp
}

static void mode_button_cal_cancel(lv_obj_t* obj, lv_event_t event)
{
	if (event == LV_EVENT_CLICKED) {
		lv_obj_move_background(bg_calgui);
		lv_obj_move_foreground(bg_middle);
		lv_obj_move_background(bg_top_cal);
		lv_obj_move_foreground(bg_top);
		f_cal_ad8307 = false;
		start_measurement();
		lv_indev_set_group(encoder_indev_t, vfo_group);
	}
}

static void mode_button_cal_save(lv_obj_t* obj, lv_event_t event)
{
	if (event == LV_EVENT_CLICKED) {
		lv_obj_move_background(bg_calgui);
		lv_obj_move_foreground(bg_middle);
		lv_obj_move_background(bg_top_cal);
		lv_obj_move_foreground(bg_top);
		f_cal_ad8307 = false;
		Serial.println("db10m[0]: " + String(R.cal_AD[0].db10m) + " Fwd[0]: " + String(R.cal_AD[0].Fwd) + " Rev[0]: " + String(R.cal_AD[0].Rev));
		Serial.println("db10m[1]: " + String(R.cal_AD[1].db10m) + " Fwd[1]: " + String(R.cal_AD[1].Fwd) + " Rev[1]: " + String(R.cal_AD[1].Rev));
		start_measurement();
		SaveEEPROM();
		lv_indev_set_group(encoder_indev_t, vfo_group);
	}
}

static void lv_spinbox_increment_event_ad1(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		lv_spinbox_increment(ad_spinbox1);
		R.cal_AD[0].db10m = lv_spinbox_get_value(ad_spinbox1);
	}
}

static void lv_spinbox_decrement_event_ad1(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		lv_spinbox_decrement(ad_spinbox1);
		R.cal_AD[0].db10m = lv_spinbox_get_value(ad_spinbox1);
	}
}

static void lv_spinbox_increment_event_ad2(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		lv_spinbox_increment(ad_spinbox2);
		R.cal_AD[1].db10m = lv_spinbox_get_value(ad_spinbox2);
	}
}

static void lv_spinbox_increment_event_ad4(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		lv_spinbox_increment(ad_spinbox4);
		R.cal_AD[1].Fwd = (double)lv_spinbox_get_value(ad_spinbox4) / 1000.0;
	}
}

static void lv_spinbox_decrement_event_ad3(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		lv_spinbox_decrement(ad_spinbox3);
		R.scale_watt = lv_spinbox_get_value(ad_spinbox3);
	}
}

static void lv_spinbox_increment_event_ad3(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		lv_spinbox_increment(ad_spinbox3);
		R.scale_watt = lv_spinbox_get_value(ad_spinbox3);
	}
}

static void lv_spinbox_decrement_event_ad2(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		lv_spinbox_decrement(ad_spinbox2);
		R.cal_AD[1].db10m = lv_spinbox_get_value(ad_spinbox2);
	}
}

static void lv_spinbox_decrement_event_ad4(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		lv_spinbox_decrement(ad_spinbox4);
		R.cal_AD[1].Fwd = (double)lv_spinbox_get_value(ad_spinbox4) / 1000.0;
	}
}

static void lv_spinbox_event_save(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		
		R.cal_AD[0].db10m = lv_spinbox_get_value(ad_spinbox1);
		R.cal_AD[0].Rev = R.cal_AD[0].Fwd = adc_ref * ((double)analogRead(FWD_METER) / 4096.0);
		lv_spinbox_set_value(ad_spinbox4, (uint32_t)(R.cal_AD[0].Fwd * 1000.0));
	}
}

static void lv_spinbox_event_save1(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {

		R.cal_AD[1].db10m = lv_spinbox_get_value(ad_spinbox2);
		R.cal_AD[1].Rev = R.cal_AD[1].Fwd = adc_ref * ((double)analogRead(FWD_METER) / 4096.0);
		lv_spinbox_set_value(ad_spinbox4, (uint32_t)(R.cal_AD[0].Fwd * 1000.0));
	}
}

static void lv_spinbox_event_copy(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) 
	{
		// Set second calibration point at 30 dB less
		R.cal_AD[1].db10m = R.cal_AD[0].db10m - 300;
		R.cal_AD[1].Fwd = R.cal_AD[0].Fwd - LOGAMP1_SLOPE * .001 * 30;
		R.cal_AD[1].Rev = R.cal_AD[0].Fwd - LOGAMP2_SLOPE * .001 * 30;
		lv_spinbox_set_value(ad_spinbox2, R.cal_AD[1].db10m);
	}
}

static void lv_spinbox_event_save4(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		uint32_t value;

		value = lv_spinbox_get_value(ad_spinbox4);
		R.cal_AD[0].Rev = R.cal_AD[0].Fwd = (double) value / 1000.0;
	}
}

static void lv_spinbox_event_save5(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		uint32_t value;

		value = lv_spinbox_get_value(ad_spinbox4);
		R.cal_AD[1].Rev = R.cal_AD[1].Fwd = (double)value / 1000.0;
	}
}

static void init_cal_ad8307_gui(lv_obj_t* scr)
{
	bg_top_cal = lv_obj_create(scr, bg_top);
	lv_obj_move_background(bg_top_cal);

	bg_calgui = lv_obj_create(scr, NULL);
	lv_obj_clean_style_list(bg_calgui, LV_OBJ_PART_MAIN);
	lv_obj_set_style_local_bg_opa(bg_calgui, LV_OBJ_PART_MAIN, LV_STATE_DEFAULT, LV_OPA_COVER);
	lv_obj_set_style_local_bg_color(bg_calgui, LV_OBJ_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_BLACK);
	lv_obj_set_pos(bg_calgui, 0, topHeight);
	lv_obj_set_size(bg_calgui, LV_HOR_RES, screenHeight - topHeight);
	lv_obj_move_background(bg_calgui);

	label_cal = lv_label_create(bg_top_cal, NULL);
	lv_label_set_text(label_cal, "AD8307 Calibration");
	lv_obj_align(label_cal, NULL, LV_ALIGN_IN_TOP_MID, 50, 5);

#define XPOS_SPIN		-50
#define POS_SPIN		-80
#define POS_SPIN_DELTA	45

	cal_group = lv_group_create();

	ad_spinbox1 = lv_spinbox_create(bg_calgui, NULL);
	lv_spinbox_set_range(ad_spinbox1, 0, 999);
	lv_spinbox_set_digit_format(ad_spinbox1, 3, 2);
	lv_spinbox_step_prev(ad_spinbox1);
	lv_obj_set_width(ad_spinbox1, 50);
	lv_obj_align(ad_spinbox1, NULL, LV_ALIGN_CENTER, XPOS_SPIN, POS_SPIN);
	lv_spinbox_set_value(ad_spinbox1, R.cal_AD[0].db10m);

	ad_spinbox2 = lv_spinbox_create(bg_calgui, NULL);
	lv_spinbox_set_range(ad_spinbox2, 0, 999);
	lv_spinbox_set_digit_format(ad_spinbox2, 3, 2);
	lv_spinbox_step_prev(ad_spinbox2);
	lv_obj_set_width(ad_spinbox2, 50);
	lv_obj_align(ad_spinbox2, NULL, LV_ALIGN_CENTER, XPOS_SPIN, POS_SPIN + POS_SPIN_DELTA);
	lv_spinbox_set_value(ad_spinbox2, R.cal_AD[1].db10m);

	ad_spinbox3 = lv_spinbox_create(bg_calgui, NULL);
	lv_spinbox_set_range(ad_spinbox3, 0, 999);
	lv_spinbox_set_digit_format(ad_spinbox3, 3, 0);
	lv_spinbox_step_prev(ad_spinbox3);
	lv_obj_set_width(ad_spinbox3, 50);
	lv_obj_align(ad_spinbox3, NULL, LV_ALIGN_CENTER, XPOS_SPIN, POS_SPIN + 2* POS_SPIN_DELTA);
	lv_spinbox_set_value(ad_spinbox3, R.scale_watt);

	ad_spinbox4 = lv_spinbox_create(bg_calgui, NULL);
	lv_spinbox_set_range(ad_spinbox4, 0, 9999);
	lv_spinbox_set_digit_format(ad_spinbox4, 4, 1);
	lv_spinbox_step_prev(ad_spinbox4);
	lv_obj_set_width(ad_spinbox4, 50);
	lv_obj_align(ad_spinbox4, NULL, LV_ALIGN_CENTER, XPOS_SPIN, POS_SPIN + 3 * POS_SPIN_DELTA);
	lv_spinbox_set_value(ad_spinbox4, (int32_t)(R.cal_AD[0].Fwd * 1000.0));

	lv_obj_t* pwd_label1 = lv_label_create(bg_calgui, NULL);
	lv_label_set_text(pwd_label1, "Ref1:");
	lv_obj_align(pwd_label1, ad_spinbox1, LV_ALIGN_OUT_LEFT_MID, -45, 0); 

	pwd_label1 = lv_label_create(bg_calgui, NULL);
	lv_label_set_text(pwd_label1, "dbm");
	lv_obj_align(pwd_label1, ad_spinbox1, LV_ALIGN_OUT_LEFT_MID, -45, 14);

	pwd_label1 = lv_label_create(bg_calgui, NULL);
	lv_label_set_text(pwd_label1, "Ref2:");
	lv_obj_align(pwd_label1, ad_spinbox2, LV_ALIGN_OUT_LEFT_MID, -45, 0);

	pwd_label1 = lv_label_create(bg_calgui, NULL);
	lv_label_set_text(pwd_label1, "dbm");
	lv_obj_align(pwd_label1, ad_spinbox2, LV_ALIGN_OUT_LEFT_MID, -45, 14); 
	
	pwd_label1 = lv_label_create(bg_calgui, NULL);
	lv_label_set_text(pwd_label1, "Watt:");
	lv_obj_align(pwd_label1, ad_spinbox3, LV_ALIGN_OUT_LEFT_MID, -45, 0);
	
	pwd_label1 = lv_label_create(bg_calgui, NULL);
	lv_label_set_text(pwd_label1, "Volt:");
	lv_obj_align(pwd_label1, ad_spinbox4, LV_ALIGN_OUT_LEFT_MID, -45, 0);

